# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseArray..::..Name Property
BaseArray Class See Also
---
Get and Set the Name property
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { set; }
```

Visual Basic
---
```text
Public Overrides WriteOnly Property Name As String
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```

# Remarks
The method set is override to forbid the user to change the Name. When the user tries to call the method set for BaseArray object, an InvalidOperationException will be thrown.
# See Also
BaseArray Class
Autodesk.Revit.DB Namespace